<?php get_header(); ?><!--header.phpを読み込むテンプレートタグ（インクルードタグ）-->
<main>
    <article class="l-hero p-hero">
            <h1 class="p-hero__title"> 
                <span><?php bloginfo( 'description' );?></span>
            </h1>
            <article class="p-hero__text">
                <div class="p-hero__wrap">
                    <ul class="p-hero__list">
                        <li>期限遵守</li>
                        <li>言語化する力</li>
                        <li>リモートコミュニケーション</li>
                    </ul>
                    <p class="c-text">3つの自負で制作活動に貢献します</p>
                    <a class="c-button" href="/about">自己紹介をもっと見る</a>
                </div>
            </article>
            <article class="p-hero__name">
                <div class="p-hero__wrap--name">
                    <h2 class="c-title">改めまして、青（あお）と申します。</h2>
                    <p class="c-text">青は本名の苗字です。
                        Web制作・ライティング業務を承ります。
                        新卒から３年半の経理業務を通じて培った、
                        細かなコミュニケーションを活かして丁寧に安心感のある業務を進めます。
                    </p>
                </div>
            </article>
    </article>
    <article class="l-main">
        <h2 class="c-title" id="skill">青にできること</h2>
        <dl class="p-skill">
        <div class="p-skill__topic">
            <dt class="c-title--skill">コーディング</dt>
            <dd class="p-skill__text">内容に適したタグの使用、CSS設計・FLOCSSをはじめとした命名規則に沿ったマークアップを行います。
            レスポンシブ対応など細かな修正も承ります。
            jQueryによるアニメーション、WordPressのテーマ制作が可能です。
            </dd>
            <dd class="p-skill__icon">
                <i class="fab fa-html5 fa-3x"></i>
                <i class="fab fa-css3-alt fa-3x"></i>
                <i class="fab fa-sass fa-3x"></i>
                <i class="fab fa-wordpress-simple fa-3x"></i>
                <i class="fab fa-github fa-3x"></i>
                <svg enable-background="new 0 0 1024 1024" height="1024px" id="Layer_1" version="1.1" viewBox="0 0 1024 1024" width="1024px" xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink"><g><g><path clip-rule="evenodd" d="M998.805,732.723c-13.82,22.922-26.303,46.783-41.688,68.604     c-76.772,108.89-181.907,172.541-313.433,192.371c-66.178,9.979-132.508,7.857-198.1-4.579     c-69.746-13.228-132.964-43.214-191.343-82.808C134.691,825.239,52.255,716.616,15.683,575.831     C-8.703,481.958-6.389,388.978,34.968,299.635c10.78-23.292,25.342-45.11,40.216-66.159     c17.196-24.337,36.655-47.075,56.563-69.713c-3.375,7.893-6.939,15.714-10.098,23.694     c-37.179,93.888-37.583,189.26-9.019,284.936c38.868,130.189,119.156,230.037,230.596,305.628     c99.967,67.806,210.821,100.244,331.678,96.827c91.813-2.595,178.04-24.681,252.769-80.38     c24.921-18.575,46.77-41.27,70.024-62.078C998.064,732.502,998.436,732.612,998.805,732.723z" fill-rule="evenodd"/><path clip-rule="evenodd" d="M1024,474.521c-7.513,14.825-14.04,29.874-22.392,43.834     c-53.706,89.768-133.248,140.99-236.166,157.154c-52.851,8.303-105.735,6.77-157.824-3.423     c-37.721-7.381-72.919-23.65-106.017-43.457c-95.812-57.337-164.044-136.989-192.522-246.309     c-24.27-93.162-11.342-180.839,46.995-259.745c11.403-15.424,22.224-31.278,33.336-46.917c0.379-0.535,0.992-0.902,2.345-2.1     c-0.418,2.044-0.443,3.358-0.947,4.451c-42.287,91.75-38.86,184.009,4.677,272.985c68.189,139.356,181.558,219.78,335.73,239.274     c86.489,10.936,167.009-8.228,236.772-62.518C987.96,512.208,1004.938,492.826,1024,474.521z" fill-rule="evenodd"/><path clip-rule="evenodd" d="M605.3,24c-4.276,17.406-10.085,34.323-12.4,51.707     c-7.479,56.16,9.264,106.64,40.688,152.367c47.184,68.662,113.273,106.404,195.819,116.046c26.303,3.071,52.43,2.894,78.281-3.25     c29.313-6.968,40.998-14.011,82.194-48.85c-2.51,4.832-3.814,7.739-5.46,10.44c-38.795,63.714-95.444,95.492-170.116,98.527     c-127.829,5.199-233.313-91.405-256.971-190.864c-13.99-58.816-4.693-113.471,31.083-162.94     C594.042,39.412,599.713,31.672,605.3,24z" fill-rule="evenodd"/></g></g></svg>
            </dd>
        </div>
        <div class="p-skill__topic">
            <dt class="c-title--skill">デザイン</dt>
            <dd class="p-skill__text">
                バナー・印刷物・デザインカンプを作成します。
                依頼主が伝えたい内容とお客様が求めている内容が交わる箇所を探し、必要十分に届くデザインを心がけています。
            </dd>
            <dd class="p-skill__icon">
            <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32">
            <path d="M0 0.401v31.198h32v-31.198zM1.333 1.734h29.333v28.531h-29.333zM7.734 7.708c0-0.089 0.188-0.156 0.297-0.156 0.859-0.042 2.12-0.068 3.438-0.068 3.698 0 5.135 2.026 5.135 4.62 0 3.391-2.458 4.844-5.469 4.844-0.51 0-0.682-0.026-1.036-0.026v5.125c0 0.109-0.042 0.156-0.151 0.156h-2.063c-0.109 0-0.151-0.042-0.151-0.151zM10.099 14.792c0.307 0.021 0.552 0.021 1.083 0.021 1.557 0 3.026-0.552 3.026-2.661 0-1.693-1.052-2.552-2.833-2.552-0.526 0-1.031 0.021-1.276 0.042zM21.578 13.203c-1.057 0-1.411 0.531-1.411 0.969 0 0.484 0.24 0.813 1.651 1.542 2.089 1.016 2.75 1.979 2.75 3.411 0 2.13-1.63 3.276-3.828 3.276-1.167 0-2.161-0.245-2.734-0.573-0.083-0.042-0.104-0.109-0.104-0.219v-1.958c0-0.13 0.063-0.177 0.151-0.109 0.833 0.552 1.802 0.792 2.682 0.792 1.057 0 1.495-0.438 1.495-1.036 0-0.484-0.307-0.901-1.646-1.604-1.896-0.906-2.688-1.828-2.688-3.37 0-1.719 1.344-3.146 3.672-3.146 1.146 0 1.953 0.177 2.396 0.37 0.109 0.068 0.13 0.177 0.13 0.266v1.828c0 0.109-0.068 0.177-0.198 0.13-0.594-0.349-1.469-0.573-2.323-0.573z"/>
            </svg>
            <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32">
            <path d="M0 0.401v31.198h32v-31.198zM1.333 1.734h29.333v28.531h-29.333zM11.099 18.068l-1.057 3.995c-0.021 0.115-0.063 0.135-0.193 0.135h-1.958c-0.135 0-0.156-0.042-0.135-0.193l3.786-13.26c0.068-0.24 0.109-0.453 0.13-1.115 0-0.089 0.047-0.13 0.115-0.13h2.792c0.089 0 0.135 0.021 0.156 0.13l4.245 14.396c0.026 0.109 0 0.172-0.109 0.172h-2.198c-0.115 0-0.177-0.026-0.198-0.115l-1.104-4.016h-4.276zM14.818 15.901c-0.375-1.474-1.255-4.703-1.583-6.266h-0.026c-0.281 1.557-0.99 4.198-1.536 6.266zM20.818 8.49c0-0.859 0.594-1.365 1.365-1.365 0.813 0 1.365 0.552 1.365 1.365 0 0.88-0.573 1.365-1.391 1.365-0.797 0-1.344-0.484-1.344-1.365zM20.969 11.521c0-0.104 0.042-0.146 0.151-0.146h2.094c0.12 0 0.161 0.042 0.161 0.156v10.526c0 0.109-0.021 0.151-0.156 0.151h-2.063c-0.135 0-0.177-0.063-0.177-0.172v-10.516z"/>
            </svg>
            <svg id="Flat" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 256 256">
            <path d="M178.94238,94.00049A37.991,37.991,0,0,0,162,22.001H94A37.991,37.991,0,0,0,77.05762,94.00049,37.97671,37.97671,0,0,0,77.05811,162,37.99416,37.99416,0,1,0,132,195.99951V151.28223a37.98414,37.98414,0,1,0,46.94238-57.28174ZM192,60.001a30.03343,30.03343,0,0,1-29.98047,29.99951L162,90l-.03857.001L132,90V30.001h30A30.03406,30.03406,0,0,1,192,60.001ZM138.71729,98.00024A38.32407,38.32407,0,0,0,132,104.71777V98.00012ZM64,60.001a30.03406,30.03406,0,0,1,30-30h30V90H94l-.019.00049A30.03392,30.03392,0,0,1,64,60.001ZM94,225.999A29.99951,29.99951,0,1,1,94,166l30-.00085v30.00036A30.03364,30.03364,0,0,1,94,225.999Zm30-68L94,158a29.99976,29.99976,0,0,1-.019-59.99951L94,98.001l30-.00086ZM162,158a29.99952,29.99952,0,0,1-.03857-59.999H162l.019-.00049A29.99976,29.99976,0,0,1,162,158Z"/>
            </svg>
            <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32">
            <path d="M26.333 0.401h-20.667c-3.136 0-5.667 2.531-5.667 5.667v19.864c0 3.136 2.531 5.667 5.667 5.667h20.667c3.136 0 5.667-2.531 5.667-5.667v-19.864c0-3.136-2.531-5.667-5.667-5.667zM30.651 25.412c0.016 2.676-2.151 4.853-4.823 4.853h-19.656c-2.667 0-4.839-2.172-4.839-4.839v-18.853c0-2.667 2.172-4.839 4.839-4.839h19.64c2.672 0 4.839 2.167 4.839 4.839zM12.651 15l3.735 7.172c0.068 0.109 0.027 0.213-0.079 0.213h-2.323c-0.145 0-0.213-0.036-0.276-0.172-0.853-1.76-1.724-3.52-2.615-5.411h-0.025c-0.803 1.785-1.683 3.667-2.537 5.427-0.061 0.104-0.129 0.145-0.239 0.145h-2.199c-0.135 0-0.145-0.109-0.077-0.187l3.651-6.959-3.531-7.041c-0.084-0.109 0-0.188 0.077-0.188h2.292c0.135 0 0.188 0.027 0.24 0.145 0.843 1.761 1.692 3.573 2.495 5.349h0.025c0.776-1.76 1.631-3.588 2.453-5.333 0.068-0.109 0.109-0.177 0.24-0.177h2.145c0.109 0 0.151 0.084 0.084 0.188zM17.041 17.172c0-3.104 2.063-5.532 5.344-5.532 0.281 0 0.427 0 0.693 0.027v-3.531c0-0.084 0.067-0.136 0.135-0.136h2.104c0.109 0 0.136 0.041 0.136 0.104v12.245c0 0.359 0 0.812 0.068 1.301 0 0.084-0.027 0.109-0.109 0.152-1.12 0.531-2.292 0.771-3.412 0.771-2.896 0.015-4.959-1.771-4.959-5.401zM23.079 13.76c-0.183-0.077-0.453-0.135-0.772-0.135-1.681 0-2.853 1.296-2.853 3.443 0 2.453 1.197 3.437 2.708 3.437 0.317 0 0.667-0.036 0.917-0.145z"/>
            </svg>
            </dd>
        </div>
        <div class="p-skill__topic">
            <dt class="c-title--skill">ライティング</dt>
            <dd class="p-skill__text">
                Webページの文面、コラム、インタビュー記事の執筆など書くこと全般を行います。
                懸賞論文で培った読みやすい文章をベースに、伝えたいヒト・モノ・コトの唯一無二の"らしさ"が伝わるように努めています。
            </dd>
        </div>
        </dl>
    </article>
    <article class="l-main-wide p-portfolio-list">
        <div class="p-portfolio-list__wave--top"></div>
        <h2 class="c-title--vertical">制作物一覧</h2>
        <div class="p-portfolio-list__wrapper">
        <?php $args = array(
        'post_type' => 'portfolio',
        'posts_per_page' => 6 //表示件数（-1で全ての記事を表示）
        );
        $the_query = get_posts( $args );
        if ( $the_query ) :
        foreach ( $the_query as $post ) : setup_postdata( $post );?>
        <section class="p-portfolio-list__card">
            <a href="<?php the_permalink(); ?>">
            <?php if ( has_post_thumbnail() ) : ?>
                <?php the_post_thumbnail();?>
            <?php else : ?>
                <img src="<?php echo get_template_directory_uri(); ?>/img/p0337_l.jpg">
            <?php endif; ?>
            <ul class="p-portfolio-list__category">
                <?php
                    if ($terms = get_the_terms($post->ID, 'portfolio_tag')) {
                    foreach ( $terms as $term ) {echo '<li>'.esc_html($term->name).'</li>';}
                    }
                ?>
            </ul>
            <h3 class="c-title--small p-portfolio-list__title"><?php the_title();?></h3>
            <p class="c-text p-portfolio-list__text"><?php echo esc_html( $post->portfolio_about ); ?></p>
            </a>
        </section>
        <?php endforeach;
        wp_reset_postdata();
        else:
        echo 'データがありません。';
        endif; 
        ?>
        </div>
        <a class="c-button p-portfolio-list__button" href="<?php echo get_post_type_archive_link( 'portfolio' ); ?>">制作物一覧をもっとみる</a>
        <div class="p-portfolio-list__wave--bottom"></div>
    </article>
    <article class="l-main">
        <h2 class="c-title--noborder" id=contact>お問い合わせ</h2>
        <article class="p-contact">
            <?php echo do_shortcode( '[contact-form-7 id="57" title="コンタクトフォーム 1"]' ); ?>
        </article>
    </article>
    <article class="l-main-wide p-post-list">
        <h2 class="c-title">ブログ記事一覧</h2>
        <div class="p-post-list__wrapper">
            <?php query_posts('posts_per_page=4'); ?>
            <?php if(have_posts()): while (have_posts()):the_post(); ?>
            <section class="p-post-list__item">
            <?php if ( has_post_thumbnail() ) : ?>
            <?php the_post_thumbnail(); ?>
            <?php else : ?>
                    <img src="<?php echo get_template_directory_uri(); ?>/img/p0337_l.jpg">
            <?php endif; ?>
                <h3 class="c-title--small p-post-list__title"><a href="<?php the_permalink(); ?>"><?php the_title(); ?></a></h3>
                <p class="c-text p-post-list__text"><?php echo get_the_excerpt(); ?></p>
                <time class="p-post-list__date">
                    <?php echo get_the_date('y/m/d'); ?>
                </time>       
            </section>
            <?php endwhile; endif; ?>
        </div>
        <a class="p-post-list__button c-button" href="/single">ブログにアクセスする</a>
    </article>
    </main>
<?php get_footer(); ?><!--footer.phpを読み込むテンプレートタグ（インクルードタグ）-->
